#ifndef BUBBLESORT_H     // Перевіряємо, чи цей заголовковий файл уже не підключено
#define BUBBLESORT_H     // Якщо ні — визначаємо макрос, щоб запобігти повторному включенню

#include <Arduino.h>     // Підключаємо бібліотеку Arduino (для типу String, Serial тощо)

// Оголошення (прототип) функції сортування методом "бульбашки"
// Параметри:
//   arr[] – масив цілих чисел, який потрібно відсортувати
//   size  – кількість елементів у масиві
void BubbleSort_Mon(int arr[], int size);

#endif  // BUBBLESORT_H
